; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v2 ?v1)
             (pred_4 ?v6 ?v7)
             (pred_10 ?v2 ?v7)
             (pred_8 ?v12 ?v2 )
	     (pred_3 ?v2)
             (pred_2 ?v5)
             (pred_9 ?v6)
             (pred_12 ?v7)
             (pred_6 ?v2)
             (pred_1 ?v6)
             (pred_11 ?v2)
             (pred_5 ))



(:action op_3
:parameters (?v10 ?v11 ?v4 ?v3)
:precondition (and (pred_2 ?v10) (pred_2 ?v11) (pred_9 ?v4) (pred_12 ?v3)
          (pred_7 ?v10 ?v11) (pred_4 ?v4 ?v3)
                   (pred_10 ?v11 ?v3) (pred_3 ?v10) 
                   (pred_6 ?v11) (pred_1 ?v4))
:effect (and  (pred_11 ?v11) (not (pred_6 ?v11))))


(:action op_5
:parameters (?v10 ?v13)
:precondition (and (pred_2 ?v10) (pred_2 ?v13)
               (pred_3 ?v10) (pred_7 ?v10 ?v13) (pred_11 ?v13))
:effect (and (pred_3 ?v13) (not (pred_3 ?v10))))

(:action op_4
:parameters (?v10 ?v4)
:precondition (and (pred_2 ?v10) (pred_9 ?v4) 
                  (pred_3 ?v10) (pred_8 ?v4 ?v10) (pred_5 ))
:effect (and (pred_1 ?v4)
   (not (pred_8 ?v4 ?v10)) (not (pred_5 ))))


(:action op_2
:parameters (?v10 ?v9 ?v8)
:precondition (and (pred_2 ?v10) (pred_9 ?v9) (pred_9 ?v8)
                  (pred_3 ?v10) (pred_1 ?v8) (pred_8 ?v9 ?v10))
:effect (and (pred_1 ?v9) (pred_8 ?v8 ?v10)
        (not (pred_1 ?v8)) (not (pred_8 ?v9 ?v10))))

(:action op_1
:parameters (?v10 ?v4)
:precondition (and (pred_2 ?v10) (pred_9 ?v4) 
                  (pred_3 ?v10) (pred_1 ?v4))
:effect (and (pred_5 ) (pred_8 ?v4 ?v10) (not (pred_1 ?v4)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_05 obj_17 obj_15 obj_01 obj_07 obj_10 obj_20 obj_14 obj_13 obj_18 obj_09 obj_03 obj_06 obj_08 obj_19
    obj_12 obj_11
    obj_04 obj_16 obj_21
    )

    (:init
       (pred_5)

       (pred_2 obj_02)
       (pred_2 obj_05)
       (pred_2 obj_17)
       (pred_2 obj_15)
       (pred_2 obj_01)
       (pred_2 obj_07)
       (pred_2 obj_10)
       (pred_2 obj_20)
       (pred_2 obj_14)
       (pred_2 obj_13)
       (pred_2 obj_18)
       (pred_2 obj_09)
       (pred_2 obj_03)
       (pred_2 obj_06)
       (pred_2 obj_08)
       (pred_2 obj_19)
       (pred_12 obj_12)
       (pred_12 obj_11)
       (pred_9 obj_04)
       (pred_9 obj_16)
       (pred_9 obj_21)

       (pred_7 obj_02 obj_01)
       (pred_7 obj_02 obj_05)
       (pred_7 obj_05 obj_07)
       (pred_7 obj_05 obj_17)
       (pred_7 obj_05 obj_02)
       (pred_7 obj_17 obj_10)
       (pred_7 obj_17 obj_15)
       (pred_7 obj_17 obj_05)
       (pred_7 obj_15 obj_20)
       (pred_7 obj_15 obj_17)
       (pred_7 obj_01 obj_14)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_01 obj_02)
       (pred_7 obj_07 obj_13)
       (pred_7 obj_07 obj_10)
       (pred_7 obj_07 obj_05)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_10 obj_18)
       (pred_7 obj_10 obj_20)
       (pred_7 obj_10 obj_17)
       (pred_7 obj_10 obj_07)
       (pred_7 obj_20 obj_09)
       (pred_7 obj_20 obj_15)
       (pred_7 obj_20 obj_10)
       (pred_7 obj_14 obj_03)
       (pred_7 obj_14 obj_13)
       (pred_7 obj_14 obj_01)
       (pred_7 obj_13 obj_06)
       (pred_7 obj_13 obj_18)
       (pred_7 obj_13 obj_07)
       (pred_7 obj_13 obj_14)
       (pred_7 obj_18 obj_08)
       (pred_7 obj_18 obj_09)
       (pred_7 obj_18 obj_10)
       (pred_7 obj_18 obj_13)
       (pred_7 obj_09 obj_19)
       (pred_7 obj_09 obj_20)
       (pred_7 obj_09 obj_18)
       (pred_7 obj_03 obj_06)
       (pred_7 obj_03 obj_14)
       (pred_7 obj_06 obj_08)
       (pred_7 obj_06 obj_13)
       (pred_7 obj_06 obj_03)
       (pred_7 obj_08 obj_19)
       (pred_7 obj_08 obj_18)
       (pred_7 obj_08 obj_06)
       (pred_7 obj_19 obj_09)
       (pred_7 obj_19 obj_08)
       (pred_6 obj_20)
       (pred_6 obj_18)
       (pred_6 obj_08)
       (pred_10  obj_20 obj_12)
       (pred_10  obj_18 obj_11)
       (pred_10  obj_08 obj_11)
       (pred_11 obj_02)
       (pred_11 obj_05)
       (pred_11 obj_17)
       (pred_11 obj_15)
       (pred_11 obj_01)
       (pred_11 obj_07)
       (pred_11 obj_10)
       (pred_11 obj_14)
       (pred_11 obj_13)
       (pred_11 obj_09)
       (pred_11 obj_03)
       (pred_11 obj_06)
       (pred_11 obj_19)

       (pred_4  obj_04 obj_12)
       (pred_4  obj_16 obj_11)
       (pred_4  obj_21 obj_11)
       (pred_8 obj_04 obj_18)
       (pred_8 obj_16 obj_18)
       (pred_8 obj_21 obj_03)
       (pred_3 obj_17)
    )

    (:goal (and
       (pred_8 obj_21 obj_15)
    ))
(:constraints
  (always (not (pred_3 obj_14)))
)
)

; plan
1. (op_5 obj_17 obj_05)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_05)
   goals met: 0 of 1
2. (op_5 obj_05 obj_07)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_07)
   goals met: 0 of 1
3. (op_5 obj_07 obj_13)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_13)
   goals met: 0 of 1
4. (op_5 obj_13 obj_06)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_06)
   goals met: 0 of 1
5. (op_5 obj_06 obj_03)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_03)
   goals met: 0 of 1
6. (op_4 obj_03 obj_21)
   deleted: (pred_8 obj_21 obj_03) (pred_5)
   added: (pred_1 obj_21)
   goals met: 0 of 1
7. (op_5 obj_03 obj_06)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_06)
   goals met: 0 of 1
8. (op_5 obj_06 obj_13)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_13)
   goals met: 0 of 1
9. (op_5 obj_13 obj_07)
   deleted: (pred_3 obj_13)
   added: (pred_3 obj_07)
   goals met: 0 of 1
10. (op_5 obj_07 obj_05)
   deleted: (pred_3 obj_07)
   added: (pred_3 obj_05)
   goals met: 0 of 1
11. (op_5 obj_05 obj_17)
   deleted: (pred_3 obj_05)
   added: (pred_3 obj_17)
   goals met: 0 of 1
12. (op_5 obj_17 obj_15)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_15)
   goals met: 0 of 1
13. (op_1 obj_15 obj_21)
   deleted: (pred_1 obj_21)
   added: (pred_5) (pred_8 obj_21 obj_15)
   goals met: 1 of 1
